{
  "education": [
    {
      "school":"Loyola Marymount University",
      "degree":"Bachelor of Science",
      "fields": {
        "majors":["Computer Science"],
        "minors":["Animation"]
      },
      "startDate":{"month":9,"year":2017},
      "endDate":{"month":5,"year":2021},
      "additional":{
        "gpa": "3.92",
        "honors":[
          {"name":"Summa Cum Laude", "description":"Highest academic honors upon graduation."},
          {"name":"Dean's List", "description":"Academic honors granted per semester."}
        ],
        "coCurriculars":[
          {"name":"Kyoudai", "description":"Japanese Culture Club", "role":"eboard"},
          {"name":"Alpha Sigma Nu", "description":"Jesuit Honor Society", "role": "member"},
          {"name":"ACM LMU Chapter", "description":"Association for Computing Machinery", "role": "member"}
        ]
      }
    },
    {
      "school":"Loyola Marymount University",
      "degree":"Master of Science",
      "fields": {
        "majors":["Computer Science"]
      },
      "startDate":{"month":4,"year":2021},
      "endDate":{"month":5,"year":2023},
      "additional":{
        "gpa": "4.0",
        "honors":[],
        "coCurriculars":[]
      }
    }
  ],
  "experience":[
    {
      "organization":"Aberythmic LLC",
      "position":"Software Engineer",
      "startDate": {"month":8,"year":2021},
      "summaryPoints": [
        "Implemented a GraphQL API extending a Django codebase to securely expose and aggregate data from a MySQL database and monitor information about asynchronous Celery tasks and events.",
        "Developed a front-end React.js webapp that interfaces with various webservices to display asset information, and images, filtering and sorting them to optimize the quality assurance process."  
    ]
    },
    {
      "organization":"Google CSSI LMU Extension",
      "position":"Teaching Assistant",
      "startDate": {"month":7,"year":2019},
      "endDate":{"month":8,"year":2019},
      "summaryPoints": [
        "Taught full-stack web development principles in Python, JavaScript, HTML5, and CSS3 to 17 college freshmen, creating sample web applications using Google App Engine and reviewing the students’ code.",
        "Interpreted student feedback and mediated with 6 administrative staff members to plan meals, recreational events, and housing accommodations, enhancing organization and productivity."  
    ]
    },
    {
      "organization":"Southland Roofing Inc.",
      "position":"Web Developer Intern",
      "startDate": {"month":7,"year":2020},
      "endDate":{"month":8,"year":2020},
      "summaryPoints": [
        "Drafted a roadmap to improve loading speed, mobile integration, and accessibility across 5 business-critical webpages, increasing loading speed by 50% and organic Google Search traffic by 10%.",
        "Instituted design standards and business priorities with marketers and designers to build accessible, business-oriented user interfaces that direct traffic to relevant webpages refining user click-through rates by 30%."  
    ]
    },
    {
      "organization":"Mozilla Builders",
      "position":"Software Engineer Hacktern",
      "startDate": {"month":3,"year":2020},
      "endDate":{"month":5,"year":2020},
      "summaryPoints": [
        "Designed a web application in a team of 2 to identify unwanted posts of a user’s image on public Instagram profiles",
        "Instituted the utilization of mobile-first development, version control with Git, and GitHub code reviews for the team workflow leading to a faster pace of development and more efficient debugging.",
        "Leveraged open-source facial recognition libraries, web scraping with Selenium, and React.js to query a face across the public posts of an Instagram user, testing for performance and Machine Learning bias."  
    ]
    },
    {
      "organization":"Google CodeU",
      "position":"Participant",
      "startDate": {"month":5,"year":2018},
      "endDate":{"month":8,"year":2018},
      "summaryPoints": [
        "Collaborated remotely in a team of 3 to build a web application using Java, JavaScript, HTML, and CSS over the course of 12 weeks, using various Google Cloud Platform APIs, including App Engine and Datastore.",
        " Applied industry best practices such as contributing to open-source software using Git and GitHub, conducting regular code reviews with and for teammates, extending an existing codebase, designing new components, and leading them to completion."  
    ]
    }
  ]


}